app/views/rental_properties/edit.html.haml

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---

=form_for RentalProperty.find(params[:id]) do |f|