app/controllers/rental_properties_controller.rb

  def index
    #reset_session
    @location = get_location
    @properties = RentalProperty.all
---
SELECT "rental_properties".* FROM "rental_properties" WHERE (rental_properties.lat IS NOT NULL AND rental_properties.lng IS NOT NULL) AND (maxpersons >= '') AND (bathrooms >= '') AND (price <= '') AND (rental_properties.lat IS NOT NULL AND rental_properties.lng IS NOT NULL) AND (rental_properties.lat>-15.000941141436389 AND rental_properties.lat<79.34505885856362 AND rental_properties.lng>-140.77820422944367 AND rental_properties.lng<-10.310995770556339) AND ((

  def show
    @location = get_location
    @property = RentalProperty.find(params[:id])
---
SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    byebug
    if params[:rental_property][:address] == ""
      flash[:warning] = "Rental Property couldn't be created"
      redirect_to new_rental_property_path and return
    end
    geo=Geokit::Geocoders::MultiGeocoder.geocode(params[:rental_property][:address])
    if geo.success
      prop = RentalProperty.new(create_update_params)
      prop.lat = geo.lat
      prop.lng = geo.lng
      if prop.save
---
INSERT INTO "rental_properties" ("title", "description", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["address", "0"], ["created_at", "2018-03-07 15:31:05.491567"], ["updated_at", "2018-03-07 15:31:05.491567"]]

  def edit
    @property = RentalProperty.find params[:id]
---
SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def update
    #make geokit adjust if changed
    @property = RentalProperty.find params[:id]
    byebug
    if params[:rental_property][:address] != (@property.address)
      geo=Geokit::Geocoders::MultiGeocoder.geocode(@property.address)
      byebug
      if geo.success
        @property.update(create_update_params)
---
SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "rental_properties" SET "pets_allowed" = ?, "price" = ?, "updated_at" = ? WHERE "rental_properties"."id" = ?  [["pets_allowed", "t"], ["price", 1000.0], ["updated_at", "2018-03-08 14:32:30.524592"], ["id", 11]]

  def destroy
    @property = RentalProperty.find(params[:id])
    @property.destroy
---
SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "rental_properties" WHERE "rental_properties"."id" = ?  [["id", 14]]